'''
Найти минимальную разницу голов

Напишите функцию, которая принимает на вход имя файла и обрабатывает содержимое 
файла CSV. Содержимым будет турнирная таблица английской Премьер-лиги по итогам 
сезона. Ваша программа должна определить, какая команда имела наименьшую разницу
голов в этом сезоне.

Первая строка CSV-файла будет представлять собой заголовки столбцов, каждая 
последующая строка будет отображать данные по одной команде:

Team,Games,Wins,Losses,Draws,Goals For,Goals Against
Arsenal,38,26,9,3,79,36

Столбцы «Goals For» и «Goals Against» содержат общее количество голов, 
забитых за и против каждой команды в этом сезоне. (Итак, «Арсенал» забил 
79 голов, а в их ворота было забито 36 голов.)

Напишите программу, которая считывает файл, а затем выводит название команды с 
наименьшей разницей в числах «За» и «Против». 
'''

'''
Найти минимальную разницу голов

Напишите программу, которая принимает на вход имя файла и обрабатывает содержимое 
файла CSV. Содержимым будет турнирная таблица английской Премьер-лиги по итогам 
сезона. Ваша программа должна определить, какая команда имела наименьшую разницу
голов в этом сезоне.

Первая строка CSV-файла будет представлять собой заголовки столбцов, каждая 
последующая строка будет отображать данные по одной команде:

Team,Games,Wins,Losses,Draws,Goals For,Goals Against
Arsenal,38,26,9,3,79,36

Столбцы «Goals For» и «Goals Against» содержат общее количество голов, 
забитых за и против каждой команды в этом сезоне. (Итак, «Арсенал» забил 
79 голов, а в их ворота было забито 36 голов.)

Напишите программу, которая считывает файл, а затем выводит название команды с 
наименьшей разницей в числах «За» и «Против». 
'''

import csv

'''
Напишите функцию parse_next_line, принимающую имя файла и возвращающую следующую
непрочитанную строку из этого файла
'''
def parse_next_line(csv_file):
    spamreader = csv.reader(csv_file, delimiter=',', quotechar='|')
    for row in spamreader:
        row = [i.strip() for i in row]
        if row[0] == "Team":
            continue
        yield row

'''
Напишите функцию get_name_and_diff, которая принимает на вход словарь с данными
о команде и возвращает название команды и разницу в голах «За» и «Против»
'''
def get_name_and_diff(team_stats):
    return (team_stats[0], abs(int(team_stats[len(team_stats)-2]) - int(team_stats[len(team_stats)-1])))


'''
Напишите функцию get_min_score_difference, которая принимает на вход имя файла
и возвращает название команды с наименьшей разницей в голах
'''
def get_min_score_difference(filename):
    with open(file=filename, mode='r', newline='') as file:
        reader = csv.DictReader(file, delimiter=',', quotechar='|')
        all_in_one = [i for i in reader]
        min = abs(int(all_in_one[0]["Goals For"]) - int(all_in_one[0]["Goals Against"]))
        name = all_in_one[0]["Team"]
        for i in all_in_one:
            tmp = abs(int(i["Goals For"]) - int(i["Goals Against"]))
            if min > tmp:
                min = tmp
                name = i["Team"]
                
        return (name, min)