"""
Напишите скрипт-калькулятор, который принимает 3 аргумента:
1. первый аргумент
2. второй аргумент
3. операцию
и вычисляет результат
"""

import sys

print(eval(sys.argv[1] + sys.argv[3] + sys.argv[2]))
